MinhTuanEE76/Vehicle/Target/STM32F407XXX/Registers/Peripherals/stm32f407xxx_gpio.h
#define GPIO_AF_PG7_EVENTOUT              GPIO_AF15
#define GPIO_AF_PG8_ETH_PPS_OUT           GPIO_AF11
#define GPIO_AF_PG8_USART6_RTS            GPIO_AF8
#define GPIO_AF_PG8_EVENTOUT              GPIO_AF15
#define GPIO_AF_PG9_USART6_RX             GPIO_AF8
#define GPIO_AF_PG9_FSMC_NE2              GPIO_AF12
#define GPIO_AF_PG9_FSMC_NCE3             GPIO_AF12
#define GPIO_AF_PG9_EVENTOUT              GPIO_AF15
#define GPIO_AF_PG10_FSMC_NCE4_1          GPIO_AF12
#define GPIO_AF_PG10_FSMC_NE3             GPIO_AF12
#define GPIO_AF_PG10_EVENTOUT             GPIO_AF15
#define GPIO_AF_PG11_ETH_MII_TX_EN        GPIO_AF11
#define GPIO_AF_PG11_ETH_RMII_TX_EN       GPIO_AF11
#define GPIO_AF_PG11_FSMC_NCE4_2          GPIO_AF12
#define GPIO_AF_PG11_EVENTOUT             GPIO_AF15
#define GPIO_AF_PG12_USART6_RTS           GPIO_AF8
#define GPIO_AF_PG12_FSMC_NE4             GPIO_AF12
#define GPIO_AF_PG12_EVENTOUT             GPIO_AF15
#define GPIO_AF_PG13_ETH_MII_TXD0         GPIO_AF11
#define GPIO_AF_PG13_ETH_RMII_TXD0        GPIO_AF11
#define GPIO_AF_PG13_USART6_CTS           GPIO_AF8
#define GPIO_AF_PG13_FSMC_A24             GPIO_AF12
#define GPIO_AF_PG13_EVENTOUT             GPIO_AF15
#define GPIO_AF_PG14_ETH_MII_TXD1         GPIO_AF11
#define GPIO_AF_PG14_ETH_RMII_TXD1        GPIO_AF11
#define GPIO_AF_PG14_USART6_TX            GPIO_AF8
#define GPIO_AF_PG14_FSMC_A25             GPIO_AF12
#define GPIO_AF_PG14_EVENTOUT             GPIO_AF15
#define GPIO_AF_PG15_USART6_CTS           GPIO_AF8
#define GPIO_AF_PG15_DCMI_D13             GPIO_AF13
#define GPIO_AF_PG15_EVENTOUT             GPIO_AF15
#define GPIO_AF_PH0_EVENTOUT             GPIO_AF15
#define GPIO_AF_PH1_EVENTOUT             GPIO_AF15
#define GPIO_AF_PH2_ETH_MII_CRS          GPIO_AF11
#define GPIO_AF_PH2_EVENTOUT             GPIO_AF15
#define GPIO_AF_PH3_ETH_MII_COL          GPIO_AF11
#define GPIO_AF_PH3_EVENTOUT             GPIO_AF15
#define GPIO_AF_PH4_I2C2_SCL             GPIO_AF4
#define GPIO_AF_PH4_OTG_HS_ULPI_NXT      GPIO_AF10
#define GPIO_AF_PH4_EVENTOUT             GPIO_AF15
#define GPIO_AF_PH5_I2C2_SDA             GPIO_AF4
#define GPIO_AF_PH5_EVENTOUT             GPIO_AF15
#define GPIO_AF_PH6_I2C2_SMBA            GPIO_AF4
#define GPIO_AF_PH6_TIM12_CH1            GPIO_AF9
#define GPIO_AF_PH6_ETH_MII_RXD2         GPIO_AF11
#define GPIO_AF_PH6_EVENTOUT             GPIO_AF15
#define GPIO_AF_PH7_I2C3_SCL             GPIO_AF4
#define GPIO_AF_PH7_ETH_MII_RXD3         GPIO_AF11
#define GPIO_AF_PH7_EVENTOUT             GPIO_AF15
#define GPIO_AF_PH8_I2C3_SDA             GPIO_AF4
#define GPIO_AF_PH8_DCMI_HSYNC           GPIO_AF13
#define GPIO_AF_PH8_EVENTOUT             GPIO_AF15
#define GPIO_AF_PH9_TIM12_CH2            GPIO_AF9
#define GPIO_AF_PH9_DCMI_D0              GPIO_AF13
#define GPIO_AF_PH9_EVENTOUT             GPIO_AF15
#define GPIO_AF_PH10_TIM5_CH1             GPIO_AF2
#define GPIO_AF_PH10_DCMI_D1              GPIO_AF13
#define GPIO_AF_PH10_EVENTOUT             GPIO_AF15
#define GPIO_AF_PH11_TIM5_CH2             GPIO_AF2
#define GPIO_AF_PH11_DCMI_D2              GPIO_AF13
#define GPIO_AF_PH11_EVENTOUT             GPIO_AF15
#define GPIO_AF_PH12_TIM5_CH3             GPIO_AF2
#define GPIO_AF_PH12_DCMI_D3              GPIO_AF13
#define GPIO_AF_PH12_EVENTOUT             GPIO_AF15
#define GPIO_AF_PH13_CAN1_TX              GPIO_AF9
#define GPIO_AF_PH13_DCMI_D4              GPIO_AF13
#define GPIO_AF_PH13_EVENTOUT             GPIO_AF15
#define GPIO_AF_PH14_TIM8_CH1N            GPIO_AF3
#define GPIO_AF_PH14_DCMI_D4              GPIO_AF13
#define GPIO_AF_PH14_EVENTOUT             GPIO_AF15
#define GPIO_AF_PH15_TIM8_CH2N            GPIO_AF3
#define GPIO_AF_PH15_DCMI_D11             GPIO_AF13
#define GPIO_AF_PH15_EVENTOUT             GPIO_AF15
#define GPIO_AF_PI0_TIM5_CH4             GPIO_AF2
#define GPIO_AF_PI0_SPI2_NSS             GPIO_AF5
#define GPIO_AF_PI0_I2S2_WS              GPIO_AF5
#define GPIO_AF_PI0_DCMI_D13             GPIO_AF13
#define GPIO_AF_PI0_EVENTOUT             GPIO_AF15
#define GPIO_AF_PI1_SPI2_SCK             GPIO_AF5
#define GPIO_AF_PI1_I2S2_CK              GPIO_AF5
#define GPIO_AF_PI1_DCMI_D8              GPIO_AF13
#define GPIO_AF_PI1_EVENTOUT             GPIO_AF15
#define GPIO_AF_PI2_TIM8_CH4             GPIO_AF3
#define GPIO_AF_PI2_SPI2_MISO            GPIO_AF5
#define GPIO_AF_PI2_I2S2ext_SD           GPIO_AF5
#define GPIO_AF_PI2_DCMI_D9              GPIO_AF13
#define GPIO_AF_PI2_EVENTOUT             GPIO_AF15
#define GPIO_AF_PI3_TIM8_ETR             GPIO_AF3
#define GPIO_AF_PI3_SPI2_MOSI            GPIO_AF5
#define GPIO_AF_PI3_I2S2_SD              GPIO_AF5
#define GPIO_AF_PI3_DCMI_D10             GPIO_AF13
#define GPIO_AF_PI3_EVENTOUT             GPIO_AF15
#define GPIO_AF_PI4_TIM8_BKIN            GPIO_AF3
#define GPIO_AF_PI4_DCMI_D5              GPIO_AF13
#define GPIO_AF_PI4_EVENTOUT             GPIO_AF15
#define GPIO_AF_PI5_TIM8_CH1             GPIO_AF3
#define GPIO_AF_PI5_DCMI_VSYNC           GPIO_AF13
#define GPIO_AF_PI5_EVENTOUT             GPIO_AF15
#define GPIO_AF_PI6_TIM8_CH2             GPIO_AF3
#define GPIO_AF_PI6_DCMI_D6              GPIO_AF13
#define GPIO_AF_PI6_EVENTOUT             GPIO_AF15
#define GPIO_AF_PI7_TIM8_CH3             GPIO_AF3
#define GPIO_AF_PI7_DCMI_D7              GPIO_AF13
#define GPIO_AF_PI7_EVENTOUT             GPIO_AF15
#define GPIO_AF_PI8_EVENTOUT             GPIO_AF15
#define GPIO_AF_PI9_CAN1_RX              GPIO_AF9
#define GPIO_AF_PI9_EVENTOUT             GPIO_AF15
#define GPIO_AF_PI10_ETH_MII_RX_ER       GPIO_AF11
#define GPIO_AF_PI10_EVENTOUT            GPIO_AF15
#define GPIO_AF_PI11_EVENTOUT            GPIO_AF15
#define GPIO_AF_PI12_EVENTOUT            GPIO_AF15
#define GPIO_AF_PI13_EVENTOUT            GPIO_AF15
#define GPIO_AF_PI14_EVENTOUT            GPIO_AF15
#define GPIO_AF_PI15_EVENTOUT            GPIO_AF15


/*define GPIO Mode*/
#define GPIO_MODE_INPUT             0U
#define GPIO_MODE_OUTPUT            1U
#define GPIO_MODE_ALTF              2U
#define GPIO_MODE_ANALOG            3U

/*Define GPIO_TYPE */
#define GPIO_TYPE_PUSHPULL          0U
#define GPIO_TYPE_OPEN_DRAIN        1U

/*Define GPIO_Speed*/
#define GPIO_SPEED_LOW              0U
#define GPIO_SPEED_MEDIUM           1U
#define GPIO_SPEED_HIGH             2U
#define GPIO_SPEED_VERY_HIGH        3U

/*Define GPIO Pulllup Pulldown*/
#define GPIO_NO_PULL                0U
#define GPIO_PULL_UP                1U
#define GPIO_PULL_DOWN              2U

#endif

